src/cf/src/AccumulationRegisters/ВзаиморасчётыСПокупателямиНалоговый/ВзаиморасчётыСПокупателямиНалоговый.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчётыСПокупателямиНалоговый</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийНалоговые</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ВозвратОтПокупателяНалоговый</types>
      <types>DocumentRef.НалоговаяНакладная</types>
      <types>DocumentRef.ВозвратПоставщикуНалоговый</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчётов</name>
    <type>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ВозвратОтПокупателяНалоговый</types>
      <types>DocumentRef.НалоговаяНакладная</types>
      <types>DocumentRef.ВозвратПоставщикуНалоговый</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/ДенежныеСредстваОрганизаций/ДенежныеСредстваОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредстваОрганизаций</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаУчет</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаВВалюте</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.ПрочиеРасходы</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладная</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.НалоговаяНакладная</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДвижения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладная</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Кассы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДенежныхСредств</name>
    <type>
      <types>CatalogRef.TypesDePayment</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Enums/ВидыОперацийНалоговые/ВидыОперацийНалоговые.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийНалоговые</name>
  <enumValues>
    <name>Накладная</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>БанковскийПеревод</name>
  </enumValues>
  <enumValues>
    <name>Наличные</name>
  </enumValues>
  <enumValues>
    <name>Чек</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Enums/ТипыДвиженияДенежныхСредств/ТипыДвиженияДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДвиженияДенежныхСредств</name>
  <enumValues>
    <name>Поступление</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Catalogs/TypesDePayment/TypesDePayment.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>TypesDePayment</name>
  <predefined>
    <items>
      <name>Сертификат</name>
      <description>Bon d'achat</description>
    </items>
    <items>
      <name>CarteBanquaire</name>
      <description>Carte bancaire</description>
    </items>
    <items>
      <name>Cheque</name>
      <description>Cheque</description>
    </items>
    <items>
      <name>Credit</name>
      <description>Credit</description>
    </items>
    <items>
      <name>Cash</name>
      <description>Espèces</description>
    </items>
    <items>
      <name>VirementBanquaire</name>
      <description>Virement bancaire</description>
    </items>
  </predefined>
</mdclass:Catalog>

src/cf/src/AccumulationRegisters/ВзаиморасчётыСПокупателямиНалоговый/ManagerModule.bsl
#Область Формирование_движений

Процедура СформироватьДвижения(ДокОбъект) Экспорт
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.НалоговаяНакладная") Тогда
		ТипОперации = Перечисления.ВидыОперацийНалоговые.Накладная;
		Описание = "" + ТипОперации + " " + ДокОбъект.Номер;
		// Налоговый регистр - в основной валюте: накладная в валюте - своей СуммаРегл (точная сумма отгрузок),
		// оплаты (деньги и ручная разбивка ТЧСпособыОплаты) - уже в основной валюте.
		СуммаДокумента = ?(ДокОбъект.ВВалюте, ДокОбъект.СуммаРегл, ДокОбъект.Сумма);
		Движение(ДокОбъект.Движения, ДокОбъект.Дата, ДокОбъект.Организация, ДокОбъект.Контрагент, ТипОперации, Описание,
			СуммаДокумента, Истина, ДокОбъект.Ссылка);
		РучнаяКорректировка = ДокОбъект.РучнаяКорректировка И Не ДокОбъект.ТЧСпособыОплаты.Количество() = 0;
		Если РучнаяКорректировка Тогда
			ТЗОплат = ДокОбъект.ТЧСпособыОплаты.Выгрузить();
		Иначе
			ТЗОплат = РегистрыНакопления.ДенежныеСредстваОрганизаций.ПолучитьОплаты(ДокОбъект,Истина);
		КонецЕсли;
		Для Каждого СтрОплат из ТЗОплат Цикл 
			Если СтрОплат.ТипДенежныхСредств = Справочники.TypesDePayment.Cheque Тогда 
				ТипОперации = Перечисления.ВидыОперацийНалоговые.Чек;
				Чек = ?(РучнаяКорректировка, СтрОплат.Чек, СтрОплат.Регистратор.Чек);
				Описание = "" + ТипОперации + " №" + Чек.Наименование + ", " + Чек.Банк +  " de " + Формат(Чек.ДатаЧека,"ДЛФ=D");
			ИначеЕсли СтрОплат.ТипДенежныхСредств = Справочники.TypesDePayment.Cash Тогда 
				ТипОперации = Перечисления.ВидыОперацийНалоговые.Наличные;
				Описание = "" + ТипОперации;
			Иначе 
				ТипОперации = Перечисления.ВидыОперацийНалоговые.БанковскийПеревод;
				Описание = "" + ТипОперации;
			КонецЕсли;
			ТипДвижения = ?(РучнаяКорректировка, Перечисления.ТипыДвиженияДенежныхСредств.Поступление,СтрОплат.ТипДвижения);
			Приход = ?(ТипДвижения = Перечисления.ТипыДвиженияДенежныхСредств.Поступление, Ложь, Истина);
			ДокРегистратор = ?(РучнаяКорректировка, ДокОбъект.Ссылка, СтрОплат.Регистратор);
			Движение(ДокОбъект.Движения, СтрОплат.Период, ДокОбъект.Организация, ДокОбъект.Контрагент, ТипОперации, Описание, СтрОплат.Сумма,Приход, ДокРегистратор);
			//КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ВозвратОтПокупателяНалоговый") Тогда
		ТипОперации = Перечисления.ВидыОперацийНалоговые.Возврат;
		Описание = "" + ТипОперации + " " + ДокОбъект.Номер;
		СуммаДокумента = ?(ДокОбъект.ВВалюте, ДокОбъект.СуммаРегл, ДокОбъект.Сумма);
		Движение(ДокОбъект.Движения, ДокОбъект.Дата, ДокОбъект.Организация, ДокОбъект.Контрагент, ТипОперации, Описание,
			СуммаДокумента, Ложь, ДокОбъект.Ссылка);
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПриходныйКассовыйОрдер")
		Или ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.РасходныйКассовыйОрдер")
		Или ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПоступлениеБезналичныхДенежныхСредств")
		Или ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.СписаниеБезналичныхДенежныхСредств") Тогда
		Если Не ДокОбъект.Организация.ОсновнойУчет Тогда Возврат; КонецЕсли;
		Если РаботаСДокументамиКлиентСервер.ЕстьРеквизит(ДокОбъект,"ХозяйственнаяОперация") Тогда 
			Если Не ОбщегоНазначенияВызовСервераПовтИсп.ЭтоРасчётыСПокупателями(ДокОбъект.ХозяйственнаяОперация) Тогда Возврат КонецЕсли;
		КонецЕсли;
		Если ДокОбъект.ТипОплаты = Справочники.TypesDePayment.Cheque Тогда 
			ТипОперации = Перечисления.ВидыОперацийНалоговые.Чек;
			Чек = ДокОбъект.Чек;
			Описание = "" + ТипОперации + " №" + Чек.Наименование + ", " + Чек.Банк +  " de " + Формат(Чек.ДатаЧека,"ДЛФ=D");
		ИначеЕсли ДокОбъект.ТипОплаты = Справочники.TypesDePayment.Cash Тогда 
			ТипОперации = Перечисления.ВидыОперацийНалоговые.Наличные;
			Описание = "" + ТипОперации;
		Иначе 
			ТипОперации = Перечисления.ВидыОперацийНалоговые.БанковскийПеревод;
			Описание = "" + ТипОперации;
		КонецЕсли;
		Приход = ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.РасходныйКассовыйОрдер");
		// Аванс - в основной валюте тем же числом, что в регистре взаиморасчётов (суммы платежа - в валюте кассы или счёта).
		СуммаОплаты = РаботаСВалютами.АвансПлатежаВОсновнойВалюте(ДокОбъект);
		Движение(ДокОбъект.Движения, ДокОбъект.Дата, ДокОбъект.Организация, ДокОбъект.Контрагент, ТипОперации, Описание, СуммаОплаты, Приход, ДокОбъект.Ссылка);
	КонецЕсли;
КонецПроцедуры

Процедура Движение(Движения, ДатаДвижения, Организация, Контрагент, ТипОперации, Описание, Сумма, Приход = Истина, ДокументДвижения)
	Если Сумма = 0 Тогда Возврат КонецЕсли;
	НС = Движения.ВзаиморасчётыСПокупателямиНалоговый.Добавить();
	НС.ВидДвижения = ?(Приход, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
	НС.Период = ДатаДвижения;
	НС.Организация = Организация;
	НС.Контрагент = Контрагент;
	НС.ВидОперации = ТипОперации;
	НС.Описание = Описание;
	НС.ДокументДвижения = ДокументДвижения;
	НС.ОбъектРасчётов = ДокументДвижения;
	НС.Сумма = Сумма;	
КонецПроцедуры

#КонецОбласти
